<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports the latest version of the Sookasa
client software via the homepage download link.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.sookasa</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/sookasa</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Sookasa File Encryption for Dropbox</string>
            <key>display_name</key>
            <string>Sookasa</string>
            <key>developer</key>
            <string>Sookasa</string>
            <key>category</key>
            <string>Internet</string>
            <key>minimum_os_version</key>
            <string>10.5.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>requires</key>
            <array>
                <string>Dropbox</string>
            </array>
            <key>unattended_install</key>
            <true/>
            <key>blocking_applications</key>
            <array>
                    <string>Sookasa.app</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.4</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.sookasa</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
